{
    "Metadata": {
      "Document Version": 6,
      "Product Name": "GitPub",
      "Document Owner": "Git Publication",
      "Developer": ["Axel", "Haikal", "Iqbal", "Chris"],
      "Stakeholder": "CV. Git Publication",
      "Document Stage": "ongoing",
      "Created Date": "2024-11-29"
    },
    "Overview": {
      "Problem Statement": {
        "Description": "The current process of publishing and sharing research papers is inefficient, leading to delays and missed opportunities for collaboration. The existing solutions lack a centralized platform for researchers to share their work, making it difficult to track and verify the authenticity of published papers.",
        "Impact": "The lack of a centralized platform for research paper sharing can lead to missed opportunities for collaboration, delayed publishing, and potential inaccuracies in published papers.",
        "Challenges": "The existing solutions lack a centralized platform for research paper sharing, making it difficult to track and verify the authenticity of published papers.",
        "Target Audience": "Researchers, academics, and students in various fields"
      },
      "Objective": {
        "Description": "The objective of this project is to develop a centralized platform for publishing and sharing research papers, ensuring authenticity, and facilitating collaboration among researchers.",
        "Goals": [
          "Create a centralized platform for publishing and sharing research papers",
          "Ensure authenticity and accuracy of published papers",
          "Facilitate collaboration among researchers"
        ]
      }
    },
    "Project Dates": {
      "Start Date": "2024-11-30",
      "End Date": "2024-12-28"
    },
    "DARCI Table": {
      "Decider": {
        "Name": "CV. Git Publication",
        "Tags": ["Project Owner", "Final Decision Maker"],
        "Guidelines": "Decides on key project decisions, such as prioritization, resource allocation, and public relations"
      },
      "Accountable": {
        "Name": "Git Publication Team",
        "Tags": ["Project Manager", "Responsible for Project Success"],
        "Guidelines": "Oversees the project, ensures tasks are completed on time, and reports to the Decider"
      },
      "Responsible": {
        "Name": ["Axel", "Haikal", "Iqbal", "Chris"],
        "Tags": ["Developers", "Responsible for Task Execution"],
        "Guidelines": "Executes specific tasks related to the project, such as development, testing, and deployment"
      },
      "Consulted": {
        "Name": ["Research Experts", "Academic Advisors"],
        "Tags": ["Experts", "Provides Input"],
        "Guidelines": "Provides input and feedback on project decisions, ensuring the project meets the needs of the target audience"
      },
      "Informed": {
        "Name": ["Researchers", "Academics", "Students"],
        "Tags": ["Stakeholders", "Needs to be Kept Updated"],
        "Guidelines": "Kept informed about project progress, challenges, and results, but not actively involved in the project"
      }
    },
    "Project Timeline": [
      {
        "Time Period": "2024-11-30 - 2024-12-04",
        "Activity": "Project Planning and Kickoff",
        "PIC": "Git Publication Team"
      },
      {
        "Time Period": "2024-12-05 - 2024-12-11",
        "Activity": "Platform Development",
        "PIC": "Axel, Haikal, Iqbal, Chris"
      },
      {
        "Time Period": "2024-12-12 - 2024-12-18",
        "Activity": "Testing and Quality Assurance",
        "PIC": "Axel, Haikal, Iqbal, Chris"
      },
      {
        "Time Period": "2024-12-19 - 2024-12-28",
        "Activity": "Deployment and Rollout",
        "PIC": "Git Publication Team"
      }
    ],
    "Success Metrics": [
      {
        "Metrics": "Accuracy of Published Papers",
        "Definition": "The percentage of published papers that are verified to be accurate and authentic",
        "Actual": "N/A",
        "Target": "95%"
      },
      {
        "Metrics": "User Satisfaction",
        "Definition": "The percentage of users who are satisfied with the platform and its features",
        "Actual": "N/A",
        "Target": "90%"
      },
      {
        "Metrics": "Platform Uptime",
        "Definition": "The percentage of time the platform is available and operational",
        "Actual": "N/A",
        "Target": "99.9%"
      }
    ],
    "User Stories": [
      {
        "Title": "Dataset Access",
        "User Story": "As a researcher, I want to access a comprehensive dataset of images for training purposes",
        "Acceptance Criteria": [
          "Given I have registered on the platform, When I explore the dataset, Then I should find a diverse collection of images",
          "Given I have searched for specific images, When I filter the results, Then I should find relevant images"
        ],
        "Priority": "High"
      },
      {
        "Title": "Paper Submission",
        "User Story": "As a researcher, I want to submit my paper for review and publication",
        "Acceptance Criteria": [
          "Given I have registered on the platform, When I submit my paper, Then I should receive a confirmation email",
          "Given I have submitted my paper, When the review process is complete, Then I should receive a response on the review outcome"
        ],
        "Priority": "High"
      },
      {
        "Title": "Collaboration Tools",
        "User Story": "As a researcher, I want to collaborate with other researchers on my paper",
        "Acceptance Criteria": [
          "Given I have registered on the platform, When I invite a collaborator, Then I should receive a notification",
          "Given I have invited a collaborator, When we work on the paper together, Then we should be able to track changes and revisions"
        ],
        "Priority": "Medium"
  }
  ]
  }

  